{
   "events": [
      {
         "heading": "Interned at Georgetown University School of Medicine",
         "type": "Internship",
         "date": "Sept 2018 - Jan 2019",
         "body": "During my senior year of high school, I received the unique opportunity to intern at Georgetown University as a part of a mentorship program. I got to study neurons that regulated the gastrointestinal system of mice. I learned so much about electrophysiology and neurobiology, and my amazing mentor taught me life lessons that I will cherish forever."
      },
      {
         "heading": "Graduated from TJHSST",
         "type": "Education",
         "date": "Sept 2015 - May 2019",
         "body": "These were a quite stressful 4 years of my life, but I was able to push through and earn an Advanced Diploma. Some cool classes I took include Artificial Intelligence, Web App Development, Multivariable Calculus, and DNA Science. I was also a member of some really interesting clubs, such as Bioengineering Projects for the Future, Innovations in Concepts of Engineering, and Spanish Honor Society. I was also on the Varsity Football team for 3 years."
      },
      {
         "heading": "First Job at Mathnasium",
         "type": "Work",
         "date": "Jan 2019 - May 2019",
         "body": "This was my first real job, and I enjoyed it much more than I thought going in. I tutored kids in K-12 about math concepts and helped them sharpen their logical reasoning skills. This job opened my eyes to how much I enjoy teaching others (and unexpectedly, working with kids)."
      },
      {
         "heading": "Part-time Tutor for Acakid",
         "type": "Work",
         "date": "Jun 2019 - Jun 2021",
         "body": "Continuing from my previous job at Mathnasium, I decided to continue tutoring kids since I enjoyed it so much. I worked throughout the summer to keep busy and earn some money for college."
      },
      {
         "heading": "Started college at William & Mary",
         "type": "Education",
         "date": "Aug 2019 - Present",
         "body": "Now, I was officially starting a new phase of my life. I knew the next four years would be scary, but little did I know they'd be some of the best and most exciting years of my life."
      },
      {
         "heading": "Marketing Associate for Agency 1693",
         "type": "Work",
         "date": "Feb 2020 - Mar 2021",
         "body": "Looking to expand my horizons, I joined Agency 1693 and worked on a marketing team to help various clients grow and expand their businesses. I designed videos, logos, and other adverts to promote our client companies."
      },
      {
         "heading": "Interned at Whispearrings",
         "type": "Internship",
         "date": "Jul 2020 - Aug 2020",
         "body": "The summer after my freshman year, I did an internship at a growing startup that planned on producing wireless earrings that would play daily scheduled motivational sounds. I learned a lot about Swift and successfully developed an app to manage the whisper (sound) library and the scheduling and playing of the whispers."
      },
      {
         "heading": "Promoted to Chief Financial Officer",
         "type": "Work",
         "date": "Mar 2021 - Present",
         "body": "The spring of my sophomore year, I was excited to be selected to be the Chief Financial Officer of Agency 1693. I would be responsible for managing and overseeing the agency's revenue, project investments, and wages. I also learned how to effectively document and handle invoices and expenses."
      },
      {
         "heading": "Technology Program Coordinator for Miller EC",
         "type": "Work",
         "date": "Aug 2021 - Present",
         "body": "As my interest in entrepreneurship grew, I took on a role at William & Mary's Entrepreneurship Center. I worked on the Technology team to create applications and maintain software to propel the missions of the EC. I got to work with new technological tools to streamline backend development."
      }
   ]
}
